//============================================
// filename: initialization.c
// chip    : CSU8RP3216
// author  :
// date    : 2018-05-12
//============================================

//-------------------------------------------------
//Include Header
#include "CSU8RP3216.h"
#include "define_function.h"
#include "define_data.h"

//具体寄存器含义请参考芯片用户手册，以用户手册为准
/*----------------------------------------------------------------------------
函数名称：F_Initial_MCU
具体描述：初始化Mcu的配置
----------------------------------------------------------------------------*/
void MCU_Initialization(void)
{
	//-----------------------------------------------------------------	
	//清状态寄存器
	//-----------------------------------------------------------------
	
	////////////////【嵌入单条汇编语句示例】/////////////////////////////

	asm("clrf _STATUS");			//清状态寄存器
	//-----------------------------------------------------------------	
	//设置MCK寄存器,  关闭外部晶振,打开内部晶振,打开内部WDT晶振,内部晶振系统时钟
	//-----------------------------------------------------------------
	MCK 	= 0x80;					//MCK:(上电默认值为:1010uuu0)
									//Bit7   CST: 外部晶振启动开关
									//	1 = 外部晶振关闭
									//	0 = 外部晶振打开
									
									//Bit6   CST_IN: 内部晶振启动开关
									//	1 = 内部晶振关闭
									//	0 = 内部晶振打开
									 
									//Bit5   CST_WDT: 内部WDT晶振启动开关
									//	1 = 内部WDT晶振关闭
									//	0 = 内部WDT晶振打开									
									 
									//Bit4   EO_SLP: 外部低速晶振控制位
									//	1 = 如果选择的是外部低速晶振(32768Hz),在sleep模式下不关闭外部晶振
									//	0 = sleep模式下关闭外部晶振
									
									//Bit0   CLKSEL: 时钟源选择位
									//	0 = 内部晶振系统时钟
									//	1 = 外部晶振系统时钟

	//-----------------------------------------------------------------
	//设置WDTCON寄存器, 开启WDT, 溢出时间为 1024ms
	//说明：如果要开启WDT，首先要开启WDT晶振开关(CST_WDT)；至于RAM是否要清0，视情况而定。	   
	//-----------------------------------------------------------------				
	WDTCON	= 0x81;					//使能看门狗，1.024s溢出复位
									//WDTCON:(上电默认值为:0uuuu000)
									//Bit7   WDTEN: 看门狗使能位
									//	 0 = WDT关闭
									//   1 = WDT开启
									
									//Bit4   WDT_DLY: 看门狗复位延时使能位
									//	 0 = WDT复位不延时
									//   1 = WDT复位后延时8ms
									
									//Bit[2-0]	wdts：当wdtin为11111111b时 
									//			000   溢出时间为 2048ms    
									//			001   溢出时间为 1024ms    
									//			010   溢出时间为 512ms     
									//			011   溢出时间为 256ms     
									//			100   溢出时间为 128ms     
									//			101   溢出时间为 64ms      
									//			110   溢出时间为 32ms      
									//			111   溢出时间为 16ms  
	
	WDTIN 	= 0xff;					//WDTIN:(上电默认值为:11111111)
									//设置WDT溢出时间值	
									//当WDTIN不是FFH时，按相应的比例进行换算溢出的时间值
	//-----------------------------------------------------------------
	//清除RAM(注意：新版C编译器不需要自己清SRAM，编译器已经清了，所以不能执行这一步)	
	//-----------------------------------------------------------------	
			
	//-----------------------------------------------------------------
	//初始化IO口
	//-----------------------------------------------------------------							
	//-------------------------------
	//PT1端口[7:1], 外部中断0在状态改变时触发,使能PT1.7,PT1.2外部中断1
	//-------------------------------
	PT1CON = 0x02;					//PT1CON:(上电默认值:00000000)
									//Bit7   PT11OD: PT1.1漏极开路使能位(以便于IO口输出不同的电压值)
									//	0 = 禁止PT1.1漏极开路
									//	1 = 使能PT1.1漏极开路
								
									//Bit6   PT1W[3]: PT1.5外部中断1使能
									// 	0 = 禁止PT1.5外部中断1 
									//	1 = 使能PT1.5外部中断1
								
									//Bit5   PT1W[2]: PT1.4外部中断1使能
									//	0 = 禁止PT1.4外部中断1 
									//	1 = 使能PT1.4外部中断1
								
									//Bit4   PT1W[1]: PT1.3外部中断1使能
									//	0 = 禁止PT1.3外部中断1 
									//	1 = 使能PT1.3外部中断1
								
									//Bit3   PT1W[0]: PT1.1外部中断1使能
									//	0 = 禁止PT1.1外部中断1 
									//	1 = 使能PT1.1外部中断1
								
									//Bit2   E1M: 外部中断1触发模式
									//	1 = 外部中断1为下降沿触发
									//	0 = 外部中断1在状态改变时触发
								
									//Bit1-0 E0M[1:0]: 外部中断0触发模式
									//	00 = 外部中断0为下降沿触发
									//	01 = 外部中断0为上升沿触发
									//	10 = 外部中断0在状态改变时触发
									//	11 = 外部中断0在状态改变时触发	
	
	PT1CON1 = 0x05;					//PT1CON1(上电默认值：uuuu0000)
									//pt1.2,pt1.7 enable interupt
									//Bit3   PT1W2[3]: PT3.1外部中断1使能
									//	0 = 禁止PT3.1外部中断1 
									//	1 = 使能PT3.1外部中断1
									//Bit2   PT1W2[2]: PT1.7外部中断1使能
									//	0 = 禁止PT1.7外部中断1 
									//	1 = 使能PT1.7外部中断1
									
									//Bit1   PT1W2[1]: PT1.6外部中断1使能
									//	0 = 禁止PT1.6外部中断1 
									//	1 = 使能PT1.6外部中断1
									
									//Bit0   PT1W2[0]: PT1.2外部中断1使能
									//	0 = 禁止PT1.2外部中断1 
									//	1 = 使能PT1.2外部中断1
		
	PT1EN = 0x42;					//PT1EN:(上电默认值:0000u00u)
					 				//	0 = 定义为输入口(PT1.3 only input)
									//	1 = 定义为输出口
									//pt1.1, pt1.6 output
	
	PT1PU = 0x00;					//PT1PU:(上电默认值:0000000u)
									//	0 = 断开上拉电阻
									//	1 = 使用上拉电阻

	PT1 = 0x02;						//PT1:(上电默认值:xxxxxxxu)
									//pt1.1 default set high


	//-------------------------------
	//PT3端口[7:0]，设置P3.1/P3.3/P3.4为AD模拟输入口, P3.0为数字输入
	//-------------------------------
	PT3CON	= 0x19;					//PT3CON:(上电默认值:00000000)
									//Bit7-0 PT3CON[7:0]: GPIO3模拟/数字端口使能标志
									//	0 = 定义为数字口
									//	1 = 定义为模拟口
	
	PT3EN = 0x60;					//PT3EN:(上电默认值:00000000)
									//	0 = 定义为输入口
									//	1 = 定义为输出口	
									
	PT3PU = 0x00;					//PT3PU:(上电默认值:00000000)
									//	0 = 断开上拉电阻
									//	1 = 使用上拉电阻
									
	PT3	= 0x60;						//PT3:(上电默认值:xxxxxxxx)

	//-------------------------------
	//PT5端口[2:0]设置P5.0/P5.1/P5.2为输出口
	//-------------------------------	
	PT5CON	=	0x00;				//PT5CON:(上电默认值:00000000)
									//	[7:0]漏极开路使能位
									//	0 = 禁止PT5.3漏极开路
									//	1 = 使能PT5.3漏极开路
									
										
	PT5EN = 0x07;					//PT5EN:(上电默认值:00000000)
	
	PT5PU = 0x00;					//PT5PU:(上电默认值:00000000)

	PT5 =	0x03;					//PT5:(上电默认值:xxxxxxxx)
									//pt5.0 and 5.1 default high

	//-----------------------------------------------------------------
	//AD初始化，参考电压VDD，通道1，程序中用到AD
	//-----------------------------------------------------------------*/	
	SRADCON0 = 0x01;				//SRADCON0:(上电默认值为:uu00uu00)		
									//Bit5-4 SRADACKS[1:0]: 
									//	00 = 16个SAR_ADC时钟(SAR_ADC输入信号获取时间/要>=4us)
									//	01 = 8个SAR_ADC时钟
									//	10 = 4个SAR_ADC时钟
									//	11 = 2个SAR_ADC时钟
									
									//Bit1-0 SRADCKS[1:0]: SAR_ADC时钟
									//	00 = cpuclk(SAR_ADC采样时钟)
									//	01 = cpuclk/2
									//	10 = cpuclk/4
									//	11 = cpuclk/8

	
	SRADCON1 =	0x00;				//SRADCON1:(上电默认值为:00000000)	
									//Bit7   SRADEN: SAR_ADC使能位
									//	1 = 使能
									//	0 = 禁止
									
									//Bit6   SRADS: SAR_ADC启动位/状态控制位 
									//	1 = 开始，转换过程中
									//	0 = 停止，转换结束
									//	当置位后，启动SAR_ADC转换，转换完成会自动清0
									
									//Bit5   OFTEN: 转换结果选择控制位
									//	1 = 转换结果放在SROFT寄存器中
									//	0 = 转换结果放在SRAD寄存器中
									
									//Bit4   CALIF: 校正控制位(OFTEN为0时有效)
									//	1 = 使能校正，即SAR_ADC转换的结果是减去了SROFT失调电压值
									//	0 = 禁止校正，即SAR_ADC转换结果是没有减去SROFT失调电压值

									//Bit3   ENOV: 使能比较器溢出模式(CALIF为1时有效)
									//	1 = 使能，上溢或下溢直接是减去后的结果
									//	0 = 禁止，下溢为000h，上溢为fffh
									
									//Bit2   OFFEX: OFFSET交换
									//	1 = 比较器两端信号交换
									//	0 = 比较器两端信号不交换(正端为信号，负端为参考电压)
									
									//Bit1-0 VREFS[1:0]: SAR_ADC参考电源选择
									//	00 = VDD
									//	01 = pt3.0外部参考电源输入
									//	10 = 内部参考电压
									//	11 = 内部参考电压，pt3.0可外接电容作为内置参考电压滤波使用，以提高精度    
		

	SRADCON2 = 0x10;				//SRADCON2:(上电默认值为:0000uuuu)		
									//Bit6-4 CHS[3:0]: SAR_ADC输入通道选择位 
									//		0000 = AIN0输入 
									//		0001 = AIN1输入
									//		0010 = AIN2输入
									//		0011 = AIN3输入
									//		0100 = AIN4输入
									//		0101 = AIN5输入
									//		0110 = AIN6输入
									//		0111 = AIN7输入
									//  	1000 = AIN8输入                
									//		1001 = AIN9输入，内部1/8VDD    
									//		1010 = AIN10输入，内部参考电压 
									//		1011 = AIN11输入，内部接地     															
									//  	 其他 = 内短 
									
									//bit [1:0]	ref_sel[1:0]	
									//		vrefs[1:0] ADC参考电压配置为2'b10或2'b11，则可通过REF_SEL [1:0]选择参考如下电压，
									//							若vrefs[1:0]不是配置为2'b10或2'b11，则以下位无效。
									//		ref_sel[1:0]	内部参考电压
									//		00				1.4V
									//		01				2.0V
									//		10				3.0V
									//		11				4.0V
	SRADL=0;                          
	SRADH=0;							 
	//---------------------------------------------------------------
	//定时器0初始化，程序中用到定时器0  
	//----------------------------------------------------------------*/
	TM0CON	= 0xF0;					//设置定时器0，此处t0rate=cpu/128=4M/128=31.25K	周期=32us
									//TM0CON:(上电默认值为:0000u100)	
									//Bit7   T0EN: 定时0使能位
									//	1 = 使能TM0											
									//	0 = 禁止TM0
									
									//Bit6-4 T0RATE[2:0]: 定时0时钟选择
									//	000 = CKT0
									//	001 = CKT0/2
									//	010 = CKT0/4
									//	011 = CKT0/8
									//	100 = CKT0/16
									//	101 = CKT0/32
									//	110 = CKT0/64
									//  111 = CKT0/128									
									
									//Bit2   T0RSTB: 定时0复位
									//	1 = 禁止TM0复位
									//	0 = 使能TM0复位
									
									//Bit1-0  T0SEL[1:0]: 定时器0时钟源
									//	00 = CPUCLK
									//	01 = MCK
									//	10 = 外部32.768KHz晶振
									//	11 = 内部32KHz WDT时钟(仅当WDT晶振打开时有效)									
									
	TM0IN	=	124;				//tm0溢出时间为 32us*(124+1)=4ms	     
	                                //定时器0溢出时间计算方法：            
	                                //	定时器0溢出时间=(tm0in+1)/tm0clk 
	
	TM0CNT 	= 	0;				//清定时器0计数寄存器，只读

	//-----------------------------------------------------------------
	//定时器2初始化，程序中用到定时器2，White LED
	//-----------------------------------------------------------------*/
  	TM2CON  = 0x00;		   			//TM2CON:(上电默认值为:00000100) ，此处t2rate=cpu/128=4M/128=31.25K	周期=32us
									//Bit 7   T2EN: 定时/计数器2使能位
									//	1 = 使能TM2										
									//	0 = 禁止TM2
									
									//Bit[6-4] T2RATE[2:0]: 定时/计数器2时钟选择
									//	000 = CKT2
									//	001 = CKT2/2
									//	010 = CKT2/4
									//	011 = CKT2/8
									//	100 = CKT2/16
									//	101 = CKT2/32
									//	110 = CKT2/64
									//  111 = CKT2/128
									
									//Bit 3   T2CKS: 定时/计数器2时钟源选择位
									//	1 = PT1.0作为时钟
									//	0 = cpuclk的分频时钟
									
									//Bit 2   T2RSTB: 定时/计数器2复位
									//	1 = 禁止TM2复位
									//	0 = 使能TM2复位
									
									//Bit[1-0]  T2OUT PWM2OUT: PT1.4输出控制(仅当PT1.4配置为输出有效)
									//				00 = IO输出
									//				01 = PWM2输出
									//				10 = 蜂鸣器输出
									//				11 = PWM2输出
	
	TM2IN =0x00;					//清定时/计数器2溢出值                                       	
	TM2INH=0x00;                    //定时器2溢出时间计算方法：                                  
	                                //   	定时器2溢出时间=（tm2in[11:0]+1）/tm2clk （tm2in不为0）
	                                //tm2溢出时间为 32us*(31249+1)=1s	 
	TM2R   = 0;						//清定时/计数器2的PWM高电平占空比控制寄存器 
	TM2RH  = 0;	
	        
	TM2CNT  = 0;					//清定时/计数器2计数寄存器
	TM2CNTH	= 0;
	//-----------------------------------------------------------------
	//定时器3初始化
	//-----------------------------------------------------------------*/	              
	TM3CON = 0x00;  				//设置定时器3,设置为IO输出                                                                                                                 
	                            	//tm3con：（上电复位值为：00000100）                                                                           	                            
						        	//Bit 7 		t3en 	定时/计数器3使能位                                                                                                    
						        	//       	1：使能定时器3                                                                                                                
						        	//       	0：禁止定时器3                                                                                                                    
						        	//                                                                                                             
						        	//Bit[6:4] 	t3rate[2:0] 	定时/计数器2时钟选择                                                              
						        	//			t3rate [3:0]	tm2clk	(t3rate[3]在metch寄存器中)                                                
						        	//				000 = 		CKT2
									//				001 = 		CKT2/2
									//				010 = 		CKT2/4
									//				011 = 		CKT2/8
									//				100 = 		CKT2/16
									//				101 = 		CKT2/32
									//				110 = 		CKT2/64
									//  			 111 =		 CKT2/128                                                                  
                                                 
						        	//Bit 3 		t3cks	定时/计数器3时钟源选择位                                                                  
						        	//			1：pt1.1作为时钟                                                                                  
						        	//			0：cpuclk或mck的分频时钟                                                                          
						        	//                                                                                                             
						        	//Bit 2 		t3rstb 	定时/计数器3复位                                                                          
						        	//			1：禁止定时/计数器3复位                                                                           
						        	//			0：使能定时/计数器3复位，当将该位为0时，定时器3复位后，t2rstb会自动置1                            
						        	//                                                                                                             
						        	//Bit 1:0  	t3out pwm3out 	pt1.5口输出控制，仅当pt1.5配置为输出时有效                                        
						        	//			0	 	0	 	IO输出                                                                            
						        	//		 	0		1		PWM3输出                                                                          
						        	//			1		0		蜂鸣器输出                                                                        
						        	//			1		1		PWM3输出                                                                          
							    	                                                                                                             
	TM3IN  = 0;					                                                                                                             
	TM3INH = 0;						//清定时/计数器3溢出值                                                                                         
									//定时器3溢出时间计算方法：                                                                                    
	                            	// 	定时器3溢出时间=（tm3in[11:0]+1）/tm3clk （tm3in不为0）                                                   
	                            	                                                                                                             
	TM3R = 0;   					                                                                                                             
	TM3RH = 0;						//清定时/计数器3的PWM高电平占空比控制寄存器                                                                    
	                            	                                                                                                            
	TM3CNT = 0;              	                                                                                                          
	TM3CNTH	= 0;					//清定时/计数器3计数寄存器                                                                                     
  		
	TM3CON2 = 0x00;   				//设置死区时间                                                                                                 
									//tm3con2：（上电复位值为：00000000）                                                                          
									//Bit[7:6]	dt3ck[1:0]	定时器3死区时间时钟选择                                                               
									//			dt3ck[1:0]	dt3_clk                                                                               
									//			00       	mck                                                                                   
									//			01       	mck/2                                                                                 
									//			10       	mck/4                                                                                 
									//			11       	mck/8                                                                                 
									//                                                                                                             
									//Bit[5:3]	dt3cnt[2:0]	死区时间选择                                                                          
									//                        死区时间=dt3cnt[2:0]*dt3_clk                                                         
									//                                                                                                             
									//Bit 2		dt3_en		死区发生器3使能位                                                                     
									//           0：不使能死区发生器3                                                                              
									//           1：使能死区发生器3                                                                                
									//                                                                                                             
									//Bit 1 		p3h_oen		互补PWM3H输出使能                                                                     
									//           0：PWM3H不输出                                                                                    
									//           1：PWM3H从PT3.6输出                                                                               
									//                                                                                                             
									//Bit 0		p3l_oen		互补PWM3L输出使能                                                                     
									//           0：PWM3L不输出                                                                                    
									//           1：PWM3L从PT3.5输出 
	//--------------------------------------------      
	//定时器4初始化，程序中用到定时器4，Red LED
	//--------------------------------------------
    TM4CON =0X00;	  			//设置定时器4                                                
                                //tm4con：（上电复位值为：00000100）                                                 
						        //Bit 7 		t4en 	定时/计数器4使能位                                           
						        //       	1：使能定时器4                                                   
						        //       	0：禁止定时器4                                                  
						        //                                                                        
						        //Bit[6:4] 	t4rate[2:0] 	定时/计数器4时钟选择                                
						        //			t4rate [2:0]	tm4clk	(CKT4时钟源选择见TMCON2寄存器的t4sel[1:0]位)               
						        //			000				ckt4                                                
						        //			001				ckt4 /2                                             
						        //			010				ckt4 /4                                             
						        //			011				ckt4 /8                                             
						        //			100				ckt4 /16                                            
						        //			101				ckt4 /32                                            
						        //			110				ckt4 /64                                            
						        //			111				ckt4 /128                                                                       
						        //                                                                        
						        //Bit 3 		t4cks	定时/计数器4时钟源选择位                                    
						        //			1：pt1.0作为时钟                                                        
						        //			0：cpuclk或mck的分频时钟                                
						        //                                                                        
						        //Bit 2 		t4rstb 	定时/计数器4复位         
						        //			1：禁止定时/计数器4复位                                                 
						        //			0：使能定时/计数器4复位，当将该位为0时，定时器4复位后，t4rstb会自动置1  
						        //                                                                        
						        //Bit 1:0  	t4out pwm4out 	pt1.6口输出控制，仅当pt1.6配置为输出时有效                               
						        //			0	 	0	 	IO输出                                        
						        //		 	0		1		PWM4输出                                       
						        //			1		0		蜂鸣器输出                                   
						        //			1		1		PWM4输出                                      
							    
	TM4IN =25;				
    TM4INH =0;					//tm4溢出率为 tm4clk/(tm4in[11:0]+1)= 4M/(25+1)= 153.8k
    							//定时器4溢出时间计算方法：
                                // 	定时器4溢出时间=（tm4in[11:0]+1）/tm4clk （tm4in不为0）
                                
    TM4R =0;					
    TM4RH =0;					//清定时/计数器4的PWM高电平占空比控制寄存器
                               
    TM4CNT =0;		            
    TM4CNTH	=0;					//清定时/计数器4计数寄存器							
	//--------------------------------------------      
	//定时器初始化
	//--------------------------------------------									
  	TMCON=0X01;					//设置互补pwm3h和pwm3l,pwm波的输出脚 (上电默认值：00uuu000)
								//bit 7		p3hinv	互补PWM3H取反控制位 
								// 			0：PWM3H不取反
								// 			1：PWM3H取反输出
								//
								//bit 6		p3linv	互补PWM3L取反控制位
								//			0：PWM3L不取反
								//			1：PWM3L取反输出
								//
								//bit 2		pwm4po	PWM4输出脚选择
								//			0：PT1.6做为PWM4输出口
								//			1：PT3.6做为PWM4输出口
								//
								//bit 1		pwm3po	PWM3输出脚选择
								//			0：PT1.5做为PWM3输出口
								//			1：PT3.5做为PWM3输出口
								//
								//bit 0		pwm2po	PWM2输出脚选择
								//			0：PT1.4做为PWM2输出口
								//			1：PT5.0做为PWM2输出口
                              
								
	
	TMCON2=0X04;				//定时器的时钟选择;(上电默认值：uu000000)   
								//bit [5:4]	t4sel[1:0]	定时器4时钟源选择
								//			t4sel[1:0]	定时器4时钟源
								//			00			CPUCLK
								//			01			MCK
								//			1x			外部晶振时钟ECK，(仅当外部接外部晶振，且晶振打开时有效)
                                //
								//bit [3:2]	t3sel[1:0]	定时器3时钟源选择
								//			t3sel[1:0]	定时器3时钟源
								//			00			CPUCLK
								//			01			MCK
								//			1x			外部晶振时钟ECK，(仅当外部接外部晶振，且晶振打开时有效)
								//
								//bit [1:0]	t2sel[1:0]	定时器2时钟源选择
								//			t2sel[1:0]	定时器2时钟源(CKT2)
								//			00			CPUCLK
								//			01			MCK
								//			1x			外部晶振时钟ECK，(仅当外部接外部晶振，且晶振打开时有效)
	//-----------------------------------------------------------------
	//中断初始化
	//-----------------------------------------------------------------
	INTF =0X00;      	 		//清所有中断标志
								//intf：（上电复位值为：u0u00u00）
								//Bit 6 		tm2if		12-Bit定时/计数器2中断标志，软件清零，硬件置高
								//			1 = 发生定时中断，必须软件清0                               
								//			0 = 没发生定时中断  
								//                                      
								//Bit 4 		tm0if		8-Bit定时器0中断标志，软件清零，硬件置高      
								//			1 = 发生定时中断，必须软件清0                              
								//			0 = 没发生定时中断       
								//                                  
								//Bit 3 		sradif		AD中断中断标志，软件清零，硬件置高            
								//			1 = 发生AD中断，必须软件清0                                
								//			0 = 没发生AD中断   
								//                                       
								//Bit 1 		e1if		外部中断1中断标志，软件清零，硬件置高           
								//			1 =外部中断1发生中断，必须软件清0                           
								//			0 =外部中断1没发生中断                                     
								//
								//Bit 0 		e0if		外部中断0中断标志，软件清零，硬件置高          
								//			1 = 外部中断0发生中断，必须软件清0                          
								//			0 =外部中断0没发生中断                                     
								//		    
	INTF2 =0X00;				//清中断标志
								//intf2：（上电复位值为：uuu0uuuu）
								//Bit 5 		tm4if		12-Bit定时/计数器4中断标志，软件清零，硬件置高
                                //			1 = 发生定时中断，必须软件清0                              
	      	                    //			0 = 没发生定时中断    
	                            //
								//Bit 4 		tm3if		12-Bit定时/计数器3中断标志，软件清零，硬件置高
                                //			1 = 发生定时中断，必须软件清0                              
	      	                    //			0 = 没发生定时中断                                         
                                //
	INTF3 =0X00; 	    		//清中断标志
								//inte3：（上电复位值为：0uuuuu00）
								//Bit 7 		cmpif	比较器中断标志	
								//Bit 1 		urtif	UART串口通信发送中断标志
								//Bit 0 		urrif	UART串口通信接收中断标志       	          
	      	                    
	      	                    
	INTE =0X92;  				//开启总中断使能、TM0中断使能、外部中断1使能
								//inte：（上电复位值为：00u00u00） 
								//Bit 7 		gie			全局中断使能标志                
			         	     	//			1 = 使能所有非屏蔽中断                     
			         	     	//			0 = 不使能所有中断 
			         	     	//                       
			         	     	//Bit 6 		tm2ie		12-Bit定时/计数器2中断使能标志
			         	     	//			1 = 使能定时/计数器2中断                   
			         	     	//			0 = 不使能定时/计数器2中断  
			         	     	//              
			         	     	//Bit 4 		tm0ie		8-Bit定时器0中断使能标志      
			         	     	//			1 = 使能定时器0中断                        
			         	     	//			0 = 不使能定时器0中断                      
			         	     	//
			         	     	//Bit 3 		sradie		AD中断使能标志               
			         	     	//			1 = 使能AD中断                             
			         	     	//			0 = 不使能AD中断                           
			         	     	//
			         	     	//Bit 1 		e1ie		外部中断1使能标志              
			         	     	//			1 =使能外部中断1                           
			         	     	//			0 = 不使能外部中断1                        
			         	     	//
			         	     	//Bit 0 		e0ie		外部中断0使能标志              
			         	     	//			1 = 使能外部中断0                          
			         	     	//			0 = 不使能外部中断0                        
			         	     	//		         	     	
	INTE2 =0X00; 	    		//关闭定时器3,4中断使能
								//inte2：（上电复位值为：uu00uuuu）
								//Bit 5 		tm4ie		12-Bit定时/计数器4中断使能标志
								//			1 = 使能定时/计数器4中断
								//			0 = 不使能定时/计数器4中断
	                            //
								//Bit 4 		tm3ie		12-Bit定时/计数器3中断使能标志
								//			1 = 使能定时/计数器3中断
								//			0 = 不使能定时/计数器3中断
	                            
	INTE3 =0X00; 	    		//关闭定时器3中断使能
								//inte3：（上电复位值为：0uuuuu00）
								//Bit 7 		cmpie	比较器中断使能
								//			1 = 使能比较器中断
								//			0 = 禁止比较器中断
	                            //
								//Bit 1 		urtie	UART的发送中断使能
								//			1 = 使能UART的发送中断    
								//			0 = 禁止UART的发送中断   
								//
								//Bit 0 		urrie	UART的接收中断使能 
								//			1 = 使能UART的接收中断      
		       	                //			0 = 禁止UART的接收中断     


}





